<a href="https://colab.research.google.com/github/shivampip/python-for-finance/blob/master/03-%20General%20Pandas/Pandas-Exercises/Pandas%20Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Exercises

Time to test your new pandas skills! Use the two csv files in this folder to complete the tasks in bold below!

** NOTE: ALL TASKS MUST BE DONE IN ONE LINE OF PANDAS CODE. GOT STUCK? NO PROBLEM! CHECK OUT THE SOLUTIONS LECTURE! **

** Import pandas and read in the banklist.csv file into a dataframe called banks. **

In [0]:
import numpy as np
import pandas as pd

In [0]:
URL= "https://raw.githubusercontent.com/shivampip/python-for-finance/master/03-%20General%20Pandas/Pandas-Exercises/banklist.csv"
df= pd.read_csv(URL)

** Show the head of the dataframe **

In [3]:
# CODE HERE
df.head()

                                           Bank Name  ... Updated Date
0                                Fayette County Bank  ...     1-Jun-17
1  Guaranty Bank, (d/b/a BestBank in Georgia & Mi...  ...     1-Jun-17
2                                     First NBC Bank  ...    23-May-17
3                                      Proficio Bank  ...    18-May-17
4                      Seaway Bank and Trust Company  ...    18-May-17

[5 rows x 7 columns]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

** What are the column names? **

In [4]:
# CODE HERE
df.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

** How many States (ST) are represented in this data set? **

In [5]:
# CODE HERE
df['ST'].nunique()

44

44

** Get a list or array of all the states in the data set. **

In [6]:
# CODE HERE
df['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'], dtype=object)

** What are the top 5 states with the most failed banks? **

In [19]:
# CODE HERE
df['ST'].value_counts().head()

GA    93
FL    75
IL    67
CA    41
MN    23
Name: ST, dtype: int64

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

** What are the top 5 acquiring institutions? **

In [18]:
# CODE HERE
df['Acquiring Institution'].value_counts().head()

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

** How many banks has the State Bank of Texas acquired? How many of them were actually in Texas?**

In [20]:
# CODE HERE
df[(df['Acquiring Institution']=='State Bank of Texas')]

                                 Bank Name     City  ... Closing Date  Updated Date
4            Seaway Bank and Trust Company  Chicago  ...    27-Jan-17     18-May-17
21   The National Republic Bank of Chicago  Chicago  ...    24-Oct-14      6-Jan-16
450         Millennium State Bank of Texas   Dallas  ...     2-Jul-09     26-Oct-12

[3 rows x 7 columns]

In [71]:
sum((df['Acquiring Institution']=='State Bank of Texas') & (df['ST']=='TX'))

1

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

** What is the most common city in California for a bank to fail in?**

In [41]:
# CODE HERE
df[(df['ST']=='CA')].groupby(by="City").count().sort_values(by="CERT").tail(1)

             Bank Name  ST  ...  Closing Date  Updated Date
City                        ...
Los Angeles          4   4  ...             4             4

[1 rows x 6 columns]

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

** How many failed banks don't have the word "Bank" in their name? **

In [72]:
# CODE HERE
sum(df['Bank Name'].apply(lambda name: "Bank" not in name))

14

14

** How many bank names start with the letter 's' ? **

In [73]:
# CODE HERE
sum(df['Bank Name'].apply(lambda name: name.startswith('S')))

53

53

** How many CERT values are above 20000 ? **

In [74]:
# CODE HERE
sum(df['CERT']> 20000)

417

417

** How many bank names consist of just two words? (e.g. "First Bank" , "Bank Georgia" )**

In [75]:
# CODE HERE
sum(df['Bank Name'].apply(lambda name: len(name.split())==2))

114

114

**Bonus: How many banks closed in the year 2008? (this is hard because we technically haven't learned about time series with pandas yet! Feel free to skip this one!**

In [76]:
df['Closing Date'].dtype

dtype('O')

In [77]:
# CODE HERE
sum(df['Closing Date'].apply(lambda dtstring: "-08" in dtstring))

25

25

# GREAT JOB!

## Thanks